## 📋 Terraform Plan (DEV)

### Summary
**2** to add, **2** to change, **3** to destroy

<details>
<summary>Show Plan Details</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.cdn.aws_cloudfront_distribution.main will be updated in-place
  ~ resource "aws_cloudfront_distribution" "main" {
        id                              = "E2311S28V7SC21"
        tags                            = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Module"      = "cdn"
            "Name"        = "blog-cdn-dev"
            "Project"     = "serverless-blog"
        }
        # (25 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (1 unchanged block hidden)
        }

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.cdn.aws_cloudfront_function.admin_combined[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "admin_combined" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/AdminCombinedFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Combined Basic Auth and SPA routing for Admin site (dev)" -> null
      - etag                         = "ETVPDKIKX0DER" -> null
      - id                           = "AdminCombinedFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "AdminCombinedFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "DEPLOYED" -> null
    }

  # module.cdn.aws_cloudfront_function.admin_spa[0] will be created
  + resource "aws_cloudfront_function" "admin_spa" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // SPA routing: Keep /admin prefix to avoid cache key collision with public site
              // Admin files are stored in S3 under /admin/ prefix
              if (uri.startsWith('/admin')) {
                // For paths without file extension, serve /admin/index.html
                if (uri === '/admin' || uri === '/admin/') {
                  uri = '/admin/index.html';
                } else if (!uri.substring(6).includes('.')) {
                  // SPA route (e.g., /admin/dashboard) -> serve /admin/index.html
                  uri = '/admin/index.html';
                }
                // Paths with extensions (e.g., /admin/assets/foo.js) pass through unchanged
              }
            
              request.uri = uri;
              return request;
            }
        EOT
      + comment         = "SPA routing for Admin site - strips /admin prefix and handles SPA routes"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "AdminSpaFunction-dev"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.cdn.aws_cloudfront_function.basic_auth[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "basic_auth" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/BasicAuthFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Basic Authentication for dev environment" -> null
      - etag                         = "ETVPDKIKX0DER" -> null
      - id                           = "BasicAuthFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "BasicAuthFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "UNASSOCIATED" -> null
    }

  # module.cdn.aws_cloudfront_function.public_combined[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "public_combined" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/PublicCombinedFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Combined Basic Auth and SSG routing for public site (dev)" -> null
      - etag                         = "E3UN6WX5RRO2AG" -> null
      - id                           = "PublicCombinedFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "PublicCombinedFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "DEPLOYED" -> null
    }

  # module.cdn.aws_cloudfront_function.public_spa[0] will be created
  + resource "aws_cloudfront_function" "public_spa" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // SPA routing: For paths without file extension, serve /index.html
              if (uri === '/' || uri === '') {
                request.uri = '/index.html';
              } else if (!uri.includes('.')) {
                // SPA route (e.g., /about, /posts/123) -> serve /index.html
                request.uri = '/index.html';
              }
              // Paths with extensions (e.g., /assets/foo.js) pass through unchanged
            
              return request;
            }
        EOT
      + comment         = "SPA routing for Public site (dev)"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "PublicSpaFunction-dev"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.codebuild.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.codebuild.aws_iam_role_policy.codebuild_cloudfront will be updated in-place
  ~ resource "aws_iam_role_policy" "codebuild_cloudfront" {
        id          = "serverless-blog-codebuild-astro-role-dev:cloudfront-invalidation-policy"
        name        = "cloudfront-invalidation-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:CreateInvalidation",
                          - "cloudfront:GetInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::881302602065:distribution/E2311S28V7SC21"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 3 to destroy.

```

</details>